In [3]:
import pandas as pd

In [63]:
def print_top_three(year):
    cols = ['Name', 'Gender', 'Count']
    file_name = 'names/yob'+str(year)+'.txt'
    names_list = pd.read_csv(str(file_name), names = cols)
    return names_list.head(3)

In [64]:
print_top_three(1880)

   Name Gender  Count
0  Mary      F   7065
1  Anna      F   2604
2  Emma      F   2003

In [65]:
def print_top_three_two_years(year_1, year_2):
    cols = ['Name', 'Gender', 'Count']
    file_name_1 = 'names/yob'+str(year_1)+'.txt'
    file_name_2 = 'names/yob'+str(year_2)+'.txt'
    names_year_1 = pd.read_csv(str(file_name_1), names = cols)
    names_year_2 = pd.read_csv(str(file_name_2), names = cols)
    names_merged = pd.merge(names_year_1, names_year_2, on = ['Name', 'Gender'], suffixes=(str(year_1), str(year_2)))
     
    return names_merged.head(3)

In [66]:
print_top_three_two_years(1880, 2015)

   Name Gender  Count1880  Count2015
0  Mary      F       7065       2602
1  Anna      F       2604       5094
2  Emma      F       2003      20355